# SetVertexConnectionMap Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptBlend..::..SetVertexConnectionMap Method
SweptBlend Class See Also
---
Sets the mapping between the vertices in the top and bottom profiles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetVertexConnectionMap(
	VertexIndexPairArray vertexMap
)
```

Visual Basic
---
```text
Public Sub SetVertexConnectionMap ( _
	vertexMap As VertexIndexPairArray _
)
```

Visual C++
---
```text
public:
void SetVertexConnectionMap(
	VertexIndexPairArray^ vertexMap
)
```

# ### Parameters
vertexMap
    Type: Autodesk.Revit.DB..::..VertexIndexPairArray
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"vertexMap"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the input argument-"vertexMap"-is empty. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the document failed to regenerate. |

# See Also
SweptBlend Class
Autodesk.Revit.DB Namespace